[
  {
    "path": "posts/2021-02-14-visual-makeover-2/",
    "title": "Data Viz Makeover 2",
    "description": "Data visualisation critique and makeover on survey response towards COVID19 vaccination between countries.",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": "https://www.linkedin.com/in/kgalbindo"
      }
    ],
    "date": "2021-02-14",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Critique and suggestion\r\nClarity\r\nAesthetic\r\n\r\n3. Proposed visualisation\r\nSketch\r\nRationale\r\nVariable list\r\nData preparation\r\nVisualisation part 1 – Dot plot with error bar\r\nVisualisation part 2 – Diverging bar chart for Likert scale survey\r\n1. Gender\r\n2. Age\r\n3. Employment status\r\n4. Household Size and Children\r\n\r\nTooltip integration\r\nCapitalise country label\r\nCreating dashboard\r\n\r\n4. Observations\r\n\r\n1. Introduction\r\nThis post is part of the submission for ISSS608 DataViz Makeover assignment 2. Data visualisation critique and makeover is done on the visualisation of survey response regarding public willingness regarding COVID19 vaccination. The data is available from “Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub” [link]\r\nThe assessment criteria will be similar to the previous blog post, based on the clarity and aesthetic aspect of the visualisation (taking reference from “Data Visualization: Clarity or Aesthetics?” by Ben Jones).\r\n2. Critique and suggestion\r\nThe original data visualisation that will be assessed is shown below.\r\n\r\n\r\n\r\nFigure 1: Original data visualisation of survey response on public willingness to be vaccinated\r\n\r\n\r\n\r\nThere are room for improvement to enhance the clarity and aesthetic of the original visualisation. Currently, while the intention is clearly stated by the questions posed in the title, reader may find it difficult to navigate through the visualisation and make appropriate conclusion.\r\nClarity\r\nThe original author would like to compare the public willingness on vaccination between countries. While the first chart provides the distribution of public opinion in each country, it does not allow reader to compare between countries easily. The visualisation is sorted according to the country name in an alphabetical order, which requires reader to search for the longest blue bar to find country with highest number of strong opinions towards vaccination. In this case, the highest percentage is by any chance belongs to UK at the bottom (not so difficult to find). On the other hand, the second bar chart answers the question more directly as it is sorted in descending order by the percentage of strong opinion in each country.\r\nOn the other hand, the second bar chart on the right seems to answer the question more directly as it is sorted in descending order by the percentage of strong opinion in each country. However, both the 100% stacked bar chart and the sorted bar chart fails to convey the fact that the number of respondents from each country varies between 2000 and 5000. It is important to inform the reader about the difference in sample size and hence the uncertainty that comes when estimating the average public opinion.\r\nThere is also room for improvement in terms of the textual explanation. Currently, the title does a good job in posing the main question that the author would like to answer. However, more explanation and conclusion should be added in the visualisation to emphasise the main observations that the author has regarding public opinion on vaccination.\r\nIt is also beneficial to understand the respondent profile (overall or within each country) to help the reader assess the validity/significance of the different opinion between countries e.g. whether the response is skewed due to the distribution of a particular respondent’s profile (age, gender, etc.).\r\nAesthetic\r\nThe existing color palette (green, cyan, red, orange, blue) does not help in representing the opposing view of public opinion. Alternatively, diverging color palette like blue-grey-red can be used to represent positive, neutral, and negative opinion accordingly.\r\nLegend title is not elaborated further and left with the default field name (vac_1). Reader may wonder what is the variable/survey question being visualised here. Also, there is minor inconsistency in the length of dash character (-) in the label text.\r\nPosition of legend is selected at the top right corner which leaves a lot of whitespace at the bottom right. The space usage can be maximised by embedding the legend into the chart instead.\r\n3. Proposed visualisation\r\nSketch\r\nThe following sketch shows the proposed visualisation and the rationale behind the choices made are given below.\r\n\r\n\r\n\r\nFigure 2: Sketch of proposed visualisation\r\n\r\n\r\n\r\nRationale\r\nThe visualisation is divided into 2 parts, each with its own dashboard to allow a quick overview of average response among different variables e.g. country, gender, age group, followed up by a more detailed information for each survey questions.\r\nTo improve the comparison of response between countries and other variables, diverging bar chart is used instead of 100% stacked bar chart. By doing so, contrast between agree and disagree will be more apparent. I also choose to plot Neutral response separately rather than distributing it equally to both sides of the response, as it is important to understand how many percentage are sitting on the fence regarding vaccination and this may warrant further investigation.\r\nIt is also important to understand the uncertainty in the survey response which differs between countries due to the different sampling size. We can use dot plot with error bar to better convey the uncertainty to the reader. This will also aid in the comparison of average response between different variables.\r\nTo allow more meaningful insight, respondent profile is also considered in the analysis. This is included through interactive visualisation, leveraging the tooltip function in Tableau.\r\nThe link to Tableau visualisation can be found here\r\nVariable list\r\nFor this visualisation, we are going to consider the following variables.\r\nSurvey questions on vaccination\r\nField\r\nSurvey question\r\nvac_1\r\n“If a Covid-19 vaccine were made available to me this week, I would definitely get it.”\r\nvac2_1\r\n“I am worried about getting COVID19”\r\nvac2_2\r\n“I am worried about potential side effects of a COVID19 vaccine”\r\nvac2_3\r\n“I believe government health authorities in my country will provide me with an effective COVID19 vaccine”\r\nvac2_6\r\n“If I do not get a COVID19 vaccine when it is available, I will regret it”\r\nvac_3\r\n“If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it”\r\nRespondent profile\r\nField\r\nDescription\r\ngender\r\nGender of respondent\r\nage\r\nAge of respondent\r\nhousehold_size\r\nNumber of people in respondent’s household\r\nhousehold_children\r\nNumber of children under 18 in respondent’s household\r\nemployment_status\r\nEmployment status of respondent\r\nData preparation\r\nAs each data file corresponds to one country, it is easier if we combine all data tables into one before we proceed with creating the visualisation. We can do this by creating Union of all countries’ data. First, add connection to one of the csv file. The list of other table within the same folder can be seen in the left side panel.\r\n\r\n\r\n\r\nFigure 3: Importing one of the csv file\r\n\r\n\r\n\r\nClick on the “australia.csv” table menu and select Convert to Union.\r\n\r\n\r\n\r\nFigure 4: Creating union\r\n\r\n\r\n\r\nSelect all the csv files to be added from the left side panel and drag them to the window box. Once all the countries are added, click OK (the union creation process may take some time).\r\n\r\n\r\n\r\nFigure 5: Add files to be combined\r\n\r\n\r\n\r\nSome columns are specific to a certain country. For example, field “UAEEmirates” is relevant only to united-arab-emirates.csv data table. Therefore, we need to check if all countries have information on the relevant variables that we need. Notice that Tableau also automatically add a new field (Table Name) to indicate the table source.\r\n\r\n\r\n\r\nFigure 6: Variation in field names between data form different countries\r\n\r\n\r\n\r\nWe can use Table Name field as Country indicator by creating new calculated field to remove “.csv” extension in the Table Name. Once created, convert the data type from “String” to “Country/Region”.\r\n\r\n\r\n\r\nFigure 7: Get country name from Table Name field\r\n\r\n\r\n\r\nNext, we can remove those fields that are not in our variable list by selecting them, right click, and select Hide.\r\n\r\n\r\n\r\nFigure 8: Hide unused fields\r\n\r\n\r\n\r\nHowever, there are some fields with similar name and not indicated in the data codebook. We can display the metadata of our table by clicking on the Manage metadata icon shown below. Upon further check of the csv files, some countries like Sweden and Norway have different encoding format for Employment Status where one-hot-encoding is used (the fields employment_status_N are of Boolean type - zero or one). Other fields with similar name are profile_household_children and profile_work_stat. We should investigate this further to understand what data resides within these fields.\r\n\r\n\r\n\r\nFigure 9: Different encoding for employment status\r\n\r\n\r\n\r\nBy tabulating the count of records for each ambiguous field by countries, we can assess if we need to clean the data further. In the screenshot below, we first find out the countries with response recorded for Vac_1, which is our main variable of interest. Sweden, Norway, Finland, and Denmark have different employment status record and they also have records on Vac_1. Therefore, we cannot exclude those employment_status_N fields and we need to standardise them with records from other countries.\r\n\r\n\r\n\r\nFigure 10: Checking data in our table\r\n\r\n\r\n\r\nOn the other hand, we can hide profile_household_children and profile_work_stat as they have zero record for countries with response to Vac_1 variable. Select both from the Data pane and right click to select Hide.\r\n\r\n\r\n\r\nFigure 11: Hide fields with zero record\r\n\r\n\r\n\r\nAs the data volume is quite huge, we can improve the performance by creating a Context Filter to include only countries of interest . Drag Country to Filters pane and set the filter criteria using Condition tab as shown below.\r\n\r\n\r\n\r\nFigure 12: Filter country with response to Vac_1 question\r\n\r\n\r\n\r\nClick on the Country pill in the Filters pane and select Add to Context. Click on Apply to Worksheets and select All Using Related Data Sources.\r\n\r\n\r\n\r\nFigure 13: Apply country filter as context filter to all visualisation using related data sources\r\n\r\n\r\n\r\nTo standardise the employment status into 1 field, we need to create a new calculated field with the following formula.\r\n\r\n\r\n\r\nFigure 14: Standardise employment status field from different countries\r\n\r\n\r\n\r\nTo check if the new field works correctly, drag the new Emp Status field to the Columns shelf, change the Measure to Count and drag it to Measure Values pane.\r\n\r\n\r\n\r\nFigure 15: Check new field Emp Status\r\n\r\n\r\n\r\nNow, all employment status info is consolidated into Emp Status field. Note that there is no employment info for Israel. As we would like to compare the respondent profile (which include employment status), we should exclude Israel from our visualisation (the original author also excludes Israel from the list).\r\nWe can then proceed to hide Employment Status and employment_status_N fields by selecting them in the Data pane and right click to select Hide (note that we have to remove them from the Measure Values pane before we can hide it).\r\n\r\n\r\n\r\nFigure 16: Hide original employment status fields\r\n\r\n\r\n\r\nNotice that the count of Emp Status entries are higher than the count of Vac 1 which means not all respondents have answered vaccination questions. As the number of respondents who answer the Vac 1 question is roughly only 20% of the total respondent, there are significant number of records that will not be used. But first, let’s see if all Vac 1 responses are accompanied by the respondent information (age, employment status, household size, etc.).\r\nDrag the Age, Household Children, and Household Size fields to the Measure Values shelf and change the aggregation for Age to Count (CNT). Also, drag the Vac 1 field to Filters pane and exclude Null value. At this point, we can see that the number of counts for all fields are equal (except Israel).\r\n\r\n\r\n\r\nFigure 17: Check information completeness for Age, Household Children, and Household Size\r\n\r\n\r\n\r\nNext, for Gender, Vac 3, Vac2 1, Vac2 2, Vac2 3, Vac2 6, select all of them and drag to the Rows shelf. Select all of them by using Shift and mouse click, use right click to change the Measure to Count.\r\n\r\n\r\n\r\nFigure 18: Create Gender, Vac 3, Vac2 1, Vac2 2, Vac2 3, Vac2 6 as measure Count\r\n\r\n\r\n\r\nOnce they are converted to measure Count, select and drag all of them to Measure Values shelf.\r\n\r\n\r\n\r\nFigure 19: Count records of Gender, Vac 3, Vac2 1, Vac2 2, Vac2 3, Vac2 6\r\n\r\n\r\n\r\nNow, we know that the count for Vac 3 is less than the other fields. This means not all respondent answer Vac 3 question even though they have responded to Vac 1 question. However, we are also convinced that all countries in the list (except Israel) that has responded to Vac 1 question are accompanied by the respondent profile information (they all have the same count of records).\r\n\r\n\r\n\r\nFigure 20: Check information completeness for Gender, Vac 3, Vac2 1, Vac2 2, Vac2 3, Vac2 6\r\n\r\n\r\n\r\nAs we navigate the steps so far, it takes quite some time for Tableau to process/query the data. Therefore, it is better to exclude those unused records from the data set, rather than using context filter. To do so, export the current data into csv by choosing View Data and Export All. Save it as “FilteredData.csv”.\r\n\r\n\r\n\r\nFigure 21: View and export data\r\n\r\n\r\n\r\nWith the help of excel, we can remove those records where Vac 1 column is blank. We can first sort Vac 1 column ascendingly.\r\n\r\n\r\n\r\nFigure 22: Sort Vac 1 ascendingly\r\n\r\n\r\n\r\nDelete rows with empty Vac 1 column at the bottom of the table.\r\n\r\n\r\n\r\nFigure 23: Delete rows with empty Vac 1 at the bottom of table\r\n\r\n\r\n\r\nAlso, delete all rows which correspond to Israel.\r\n\r\n\r\n\r\nFigure 24: Delete rows corresponding to Israel data\r\n\r\n\r\n\r\nFinally, we can save the filtered file (at this point, the file size is around 6MB) and connect the data to Tableau.\r\n\r\n\r\n\r\nFigure 25: Import filtered data to Tableau\r\n\r\n\r\n\r\nAs recommended in the Tableau blog on preparing survey data, it is a good practice to have a ‘tall and thin’ data. To do so, we can pivot the Vac fields. Rename the new header accordingly to Question and Response.\r\n\r\n\r\n\r\nFigure 26: Reshape survey response fields\r\n\r\n\r\n\r\nThe response is currently of String type and we can better handle the values by converting it to integer 1-5 through calculated field. Subsequently, change the data type to Number (whole).\r\n\r\n\r\n\r\nFigure 27: Convert response to integer 1 to 5\r\n\r\n\r\n\r\nThe final data table will look like this.\r\n\r\n\r\n\r\nFigure 28: Final appearance of data table\r\n\r\n\r\n\r\nIf you are very particular about having Country label with initial capital letter, proceed to this section first before continuing.\r\nVisualisation part 1 – Dot plot with error bar\r\n As the sample size between countries is different, we convey this fact by using a dot plot to represent the average response and error bars to represent the uncertainty. To do so, we create new calculated fields for these estimates: mean, upper, and lower bound for 95% and 99% confidence interval. But first, create new calculated field to count the number of records easier.\r\n\r\n\r\n\r\nFigure 29: Calculated Fields for number of records, mean, and confidence interval\r\n\r\n\r\n\r\nDrag Measure Values to the Columns shelf. Remove all the fields from Measure Values pane except for the lower and upper 95% and 99% confidence interval. Subsequently, drag Country field to Rows shelf. Change the chart type to Line and add Measure Names to the Path in Marks shelf to connect our upper and lower bound values. To differentiate 95% and 99% bar, once again drag Measure Names to the Color in Marks shelf.\r\n\r\n\r\n\r\nFigure 30: Displaying confidence interval as line\r\n\r\n\r\n\r\nTo show our mean value as a dot plot, drag Mean field to Columns shelf, select Dual Axis and choose Synchronize Axis. Change the chart type for Mean field to Circle type. Edit the X-axis and uncheck Include zero option so that the dot and error bar is more visible. Sort the X-axis based on Mean and hide the top X-axis as it is redundant.\r\n\r\n\r\n\r\nFigure 31: Displaying mean as dot plot\r\n\r\n\r\n\r\nWe should filter by Vac 1 question to show the response on public willingness to be vaccinated. Drag Question field to Filters shelf and select Vac 1. We can then add a reference line at value equals to 3 which represent the neutral response. In general, the negative response is usually positioned at the left side and positive response is on the right side. Hence, we reverse the X-axis so that response towards 5 (strongly disagree) is on the left while response towards 1 (strongly agree) is on the right side.\r\n\r\n\r\n\r\nFigure 32: Reverse X-axis and reference line\r\n\r\n\r\n\r\nAdjust the error bar color by clicking on the Measure Names color legend and the bar size by adjusting Size in the Marks shelf. Note that the order of the lower and upper bound in the legend affect the display accordingly (arrange such that 99% confidence interval at the top, followed by 95% confidence interval and mean value).\r\n\r\n\r\n\r\nFigure 33: Adjust plot color\r\n\r\n\r\n\r\nSet the X-axis from 1 to 5 with interval of 1 and remove its title. Also, right click on the X-axis and add reference line at 5 and 1 value with label “Strongly Disagree” and “Strongly Agree” to orientate the reader that left side is negative and vice versa.\r\n\r\n\r\n\r\nFigure 34: Reference line with label\r\n\r\n\r\n\r\nAs it is difficult to trace the dot plot to the country label at the left header, we can instead label each dot with the country name and remove the Y-axis. To do so, drag Country field to Label of Measure Values in Marks shelf, change the alignment to Middle vertical.\r\n\r\n\r\n\r\nFigure 35: Create label near the data point\r\n\r\n\r\n\r\nTo allow reader to cycle among different survey question, we can show the filter by Show Filter for Question field. However, the value under Question is not intuitive and hence we need to create aliases for each question. Right click on Question in the Data pane and choose Aliases…. Fill the Value (Alias) column according to the actual survey question.\r\n\r\n\r\n\r\nFigure 36: Create alias for Question\r\n\r\n\r\n\r\nClick on the Question filter card and select single Single Value (list). Also, go to Customize and turn off Show “All” Value.\r\n\r\n\r\n\r\nFigure 37: Show filter for Question\r\n\r\n\r\n\r\nNext, we would like to provide options for reader to select how they want to split the average response; not only by Country, but also by other respondent profile such as age, gender, household size, and employment status. To do so, create a new parameter Based-on Selector and add these attributes to the List of values (taking reference from here). Right click on the parameter and select Show Parameter.\r\n\r\n\r\n\r\nFigure 38: Create new parameter to select attributes\r\n\r\n\r\n\r\nWe also need to create new calculated fields for the respondent profile data. For Age, create new group so that we can assign respondents into one of the age group. For Household Size and Household Children, we need to right click and choose create new calculated field for new categorical fields Household Size (Grp) and Household Children (Grp).\r\n\r\n\r\n\r\nFigure 39: Create new calculated fields for respondent attributes\r\n\r\n\r\n\r\nNext, create a new calculated field Placeholder1 to receive input from our [Based-on selector] parameter and drag it to our Rows shelf (replacing Country). The idea is that when reader choose the attribute from the parameter list, it will change the input to our Rows shelf.\r\n\r\n\r\n\r\nFigure 40: Create new calculated field to receive attribute selection\r\n\r\n\r\n\r\nFinally, add title to link the average response towards the selected question. As we have observed previously, one of the survey questions has less respondent as compared to the rest. We can highlight this fact by showing the number of respondents in the title. Create new calculated field SumRecords to sum up record excluding the grouping by variable in Placeholder1. Drag it to the Detail in Marks shelf so that it will show up when we edit the title.\r\n\r\n\r\n\r\nFigure 41: Create title with number of respondent\r\n\r\n\r\n\r\nFor the individual data point, we also provide the number of respondents by dragging the Number of records to the Tooltip of AGG(Mean) in Marks shelf. Add Placeholder1, average response, and number of records as shown below.\r\n\r\n\r\n\r\nFigure 42: Create tooltip for Mean\r\n\r\n\r\n\r\nAs for the tooltip of the confidence interval bar, we can show the category (Placeholder1) and the value of the confidence interval. Go to Measure Values card in Marks shelf and click on Tooltip.\r\n\r\n\r\n\r\nFigure 43: Create tooltip for confidence interval\r\n\r\n\r\n\r\nFinally, change the Measure Names legend title to “Legend” and we can hide the X-axis as the reader can refer to “Strongly Agree” and “Strongly Disagree” annotation from our reference line.\r\n\r\n\r\n\r\nFigure 44: Final touch up\r\n\r\n\r\n\r\nEdit the Filter title to orientate reader to the selection of questions.\r\n\r\n\r\n\r\nFigure 45: Change filter caption\r\n\r\n\r\n\r\nThe visualisation for part 1 will look like this.\r\n\r\n\r\n\r\nFigure 46: Final appearance for part 1\r\n\r\n\r\n\r\nVisualisation part 2 – Diverging bar chart for Likert scale survey\r\nIn the next part, we want to count the percentage of responses for each category (1-5), hence we first need to count the positive, negative, and neutral response for ResponseInt using calculated field.\r\n\r\n\r\n\r\nFigure 47: Count response\r\n\r\n\r\n\r\nNext, create another calculated field for percentage of each response category. We need to use EXCLUDE:[Response] so that the sum of number of records are calculated to include all categories (1-5) for a selected survey question.\r\n\r\n\r\n\r\nFigure 48: Count percentage of response\r\n\r\n\r\n\r\nWe then create a dual-axis chart by dragging Pct_Positive and Pct_Negative to Columns shelf, and Question to the Rows shelf. Right click on AGG(Pct_Negative) and choose Dual Axis. For neutral response, we will show it separately at the side by dragging the Pct_Neutral to the side of AGG(Pct_Negative).\r\n\r\n\r\n\r\nFigure 49: Drag measure to Rows and Columns shelf\r\n\r\n\r\n\r\nSynchronise the two axis and change the format of X-axis label to percentage. The top X-axis can be hidden to save space.\r\n\r\n\r\n\r\nFigure 50: Sync X-axis and hide\r\n\r\n\r\n\r\nChange the plot type to Bar and drag Response to Color in Marks shelf to color the bar according to the response. Change the default color by clicking on the Legend. Also, adjust the color legend so that the strongly agree and strongly disagree are centred for easy comparison. This is done by arranging the label in the color legend accordingly. We can reduce the bar size as well.\r\n\r\n\r\n\r\nFigure 51: Adjust color legend\r\n\r\n\r\n\r\nIn addition, 0% reference line is added to assist reader in finding the centre point. Set Value at 0 and Constant type, set Label as None, and use dashed line.\r\n\r\n\r\n\r\nFigure 52: Set zero reference line\r\n\r\n\r\n\r\nWe can create Aliases for Response field to better clarify the response category and fix the incosistent dash character (-) between 1 and 5.\r\n\r\n\r\n\r\nFigure 53: Set aliases for Response\r\n\r\n\r\n\r\nTo understand the respondent profile for each response category, we can make use of Tableau tooltip to show the visualisations of each respondent’s attribute. But first, we need to prepare a visualisation for each respondent attribute.\r\n1. Gender\r\nAs there are only 2 categories under gender, we can use pie chart to compare the percentage between male and female respondents. Drag Gender to Rows shelf and Number of records to Columns shelf.\r\n\r\n\r\n\r\nFigure 54: Gender measure and number of records\r\n\r\n\r\n\r\nOpen Show Me feature from the top right corner and select pie chart.\r\n\r\n\r\n\r\nFigure 55: Select pie chart from Show Me feature\r\n\r\n\r\n\r\nDrag Number of records to the Label in Marks shelf, go to Quick Table Calculation and select Percent of Total to convert the value to percentage.\r\n\r\n\r\n\r\nFigure 56: Add percentage value\r\n\r\n\r\n\r\nChange the format of % of Total field to remove decimal place.\r\n\r\n\r\n\r\nFigure 57: Set label decimal format\r\n\r\n\r\n\r\nDrag Gender to Label in Marks shelf and adjust the format of the label.\r\n\r\n\r\n\r\nFigure 58: Add gender and set label format\r\n\r\n\r\n\r\nSet the Fit setting to Entire View.\r\n\r\n\r\n\r\nFigure 59: Final appearance for gender pie chart\r\n\r\n\r\n\r\n2. Age\r\nThere are 3 age groups created in the previous part and we can use donut chart to represent the percentage among them. We can refer to this blog post to create a donut chart in Tableau.\r\nDouble-click on Rows shelf and write “avg(0)” and press enter. Repeat the same step next to the newly created AGG(avg(0)).\r\n\r\n\r\n\r\nFigure 60: Create empty cards\r\n\r\n\r\n\r\nThis will create 2 cards in Marks shelf. On the first card, change the type from Automatic to Pie. Drag Age (group) and Number of Records to Label in Marks shelf. Drag another Age (group) to Color.\r\n\r\n\r\n\r\nFigure 61: Create pie chart\r\n\r\n\r\n\r\nChange the label to percent of total.\r\n\r\n\r\n\r\nFigure 62: Create percentage label\r\n\r\n\r\n\r\nRemove the decimal place through formatting.\r\n\r\n\r\n\r\nFigure 63: Remove decimal place\r\n\r\n\r\n\r\nOn the second card, change the type to Circle. Adjust the Size (make it smaller) and set Colour to white to get the intended donut chart. Remove the Y-axis as well.\r\n\r\n\r\n\r\nFigure 64: Create donut shape\r\n\r\n\r\n\r\nTo add “Age” in the middle of the donut chart, drag Age (group) to the Label for the second AGG(avg(0)) and change the Text to “Age” instead of the age group value. Set Alignment to Middle and tick Allow labels to overlap other marks.\r\n\r\n\r\n\r\nFigure 65: Add age title in the middle of donut\r\n\r\n\r\n\r\nSet the Fit setting to Entire View.\r\n\r\n\r\n\r\nFigure 66: Final appearance for age donut chart\r\n\r\n\r\n\r\n3. Employment status\r\nFor employment status, we will use horizontal bar chart with percentage label to show the distribution. Drag Emp Status to Rows shelf and Number of records to the Columns. Right click on the SUM(Number of records), go to Quick Table Calculation and select Percent of Total to convert the value to percentage.\r\n\r\n\r\n\r\nFigure 67: Add measure and set to Percent of Total\r\n\r\n\r\n\r\nTurn on the Label and change the format of % of Total field to remove decimal place.\r\n\r\n\r\n\r\nFigure 68: Turn on the label and remove decimal place\r\n\r\n\r\n\r\nRemove X-axis and re-arrange the order of employment status accordingly.\r\n\r\n\r\n\r\nFigure 69: Reorder employment status and remove X-axis\r\n\r\n\r\n\r\nSet the Fit setting to Entire View.\r\n\r\n\r\n\r\nFigure 70: Final appearance for employment status bar chart\r\n\r\n\r\n\r\n4. Household Size and Children\r\nFor these 2 attributes, we will use vertical bar chart. Drag Household Size (Grp) to Rows shelf and Number of records to the Columns. Right click on the SUM(Number of records), go to Quick Table Calculation and select Percent of Total to convert the value to percentage.\r\n\r\n\r\n\r\nFigure 71: Add measure and change to Percent of Total\r\n\r\n\r\n\r\nTurn on the Label and change the format to remove decimal place.\r\n\r\n\r\n\r\nFigure 72: Add label and change the format\r\n\r\n\r\n\r\nRemove the Y-axis and set the Fit setting to Entire View.\r\n\r\n\r\n\r\nFigure 73: Final appearance for household size bar chart\r\n\r\n\r\n\r\nRepeat the same step for Household Children (Grp).\r\n\r\n\r\n\r\nFigure 74: Final appearance for household children bar chart\r\n\r\n\r\n\r\nTooltip integration\r\nBefore we add the above visualisation to the tooltip, make sure that each of them has Entire View selected as the Fit setting. Back to the Likert scale worksheet, we want to allow reader to view country specific responses. Drag our Country to the Filters shelf, go to Apply to Worksheets, and choose Selected Worksheets…. Ensure all worksheets corresponding to our respondent’s attribute are selected.\r\n\r\n\r\n\r\nFigure 75: Link filter to individual visualisation of each respondent attribute\r\n\r\n\r\n\r\nActivate Show Filter and use Single Value (dropdown) format for the filter interface.\r\n\r\n\r\n\r\nFigure 76: Show filter with dropdown list\r\n\r\n\r\n\r\nDrag Country and Number of records to the Tooltip for All in the Marks shelf.\r\n\r\n\r\n\r\nFigure 77: Add tooltip\r\n\r\n\r\n\r\nClick on Tooltip and insert all the visualisations that we prepared before. For the Gender, Age, and EmpStatus worksheet, we can fit them into one row (add a space between each of them). Press enter after we insert Emp Status to go to the next row, and insert HseSize and HseChild worksheet. Please note that the maxwidth and maxheight of each worksheet has been modified to fit into the tooltip. Change the Show tooltips setting to On Hover so that it does not unnecessarily show the additional info when reader is moving the pointer across the visualisation (avoid overwhelming the reader).\r\n\r\n\r\n\r\nFigure 78: Edit tooltip content\r\n\r\n\r\n\r\nNext, put the percentage of response as a label on the box so that the X-axis can be removed. Select Pct_Positive, Pct_Negative, Pct_Neutral and drag them to the Label for All in Marks shelf. Subsequently, adjust the format of the value to percentage with 0 decimal place.\r\n\r\n\r\n\r\nFigure 79: Add label and format\r\n\r\n\r\n\r\nSelect AGG(Pct_Positive) card in Marks shelf and remove AGG(Pct_Negative) and AGG(Pct_Neutral) from the Marks shelf. Do the same for AGG(Pct_Negative) and AGG(Pct_Neutral) Marks shelf, but retain AGG(Pct_Negative) and AGG(Pct_Neutral) accordingly.\r\n\r\n\r\n\r\nFigure 80: Remove label in each card\r\n\r\n\r\n\r\nHowever, now we notice that the box length for the two plots are currently not proportionally the same. For example, the neutral box for 25% is bigger than the 29% of positive box side by side.\r\n\r\n\r\n\r\nFigure 81: Box size is not proportional between Neutral and others\r\n\r\n\r\n\r\nTo fix this, we can follow a workaround described in Steve Wexler’s blog. However, there is a bit of adjustment required as we have different Level of Detail than the example in the blog. First, create new calculated fields to get highest range between positive and negative response. This will determine our Neutral X-axis range by setting an invisible reference line with that range value.\r\n\r\n\r\n\r\nFigure 82: Create new calculated fields to set up Neutral reference line\r\n\r\n\r\n\r\nBring Neutral_Ref_Line to the Detail of AGG(Pct_Neutral). Right click the X-axis of Pct_Neutral and Add Reference Line. Set Value to our Neutral_Ref_Line with Total aggregate, and set the Label and Line to None as we don’t really need to show it.\r\n\r\n\r\n\r\nFigure 83: Create new calculated fields to set up Neutral reference line\r\n\r\n\r\n\r\nNow, the box size for Neutral and Positive / Negative is proportional: the 29% response in both sides are now of similar size. We can proceed to hide the X-axis as the label has shown the percentage value.\r\n\r\n\r\n\r\nFigure 84: Proportional box size\r\n\r\n\r\n\r\nThe tooltip appearance will look like this when reader hover into one of the response boxes. Note: if gender label overlaps with the pie chart, go to the gender worksheet and reduce the size of the pie chart\r\n\r\n\r\n\r\nFigure 85: Tooltip appearance upon hovering on the box response\r\n\r\n\r\n\r\nWe can also rearrange the Question to follow the original order accordingly.\r\n\r\n\r\n\r\nFigure 86: Rearrange question order\r\n\r\n\r\n\r\nCapitalise country label\r\n This part can be skipped if you don’t mind having country label in lower case.\r\nTo capitalise the initial letter of each Country label, create new calculated field Country2.\r\n\r\n\r\n\r\nFigure 87: Capitalise country name\r\n\r\n\r\n\r\nIf you were redirected here from data preparation section, go back to this section to continue with the visualisation, and use Country2 instead of Country in the subsequent steps\r\nChange all measure Country in both visualisation part 1 and 2 with Country2.\r\n\r\n\r\n\r\nFigure 88: Change country label\r\n\r\n\r\n\r\nFinally, add title to the visualisation and edit the Filter title to better orientate the reader.\r\n\r\n\r\n\r\nFigure 89: Edit title and filter caption\r\n\r\n\r\n\r\nCreating dashboard\r\nCreate new dashboard and drag Average worksheet to the dashboard. The blue color rectangle below shows the component of our worksheet. The other components like image, text, and blank are highlighted accordingly with different colors. The image is taken from here.\r\n\r\n\r\n\r\nFigure 90: Dashboard 1\r\n\r\n\r\n\r\nCreate new dashboard and drag Questions worksheet to the dashboard. Similarly, the components are highlighted with different colors below.\r\n\r\n\r\n\r\nFigure 91: Dashboard 2\r\n\r\n\r\n\r\nOften, the format of the visualisation is not properly displayed in Tableau Public (due to different display setting between browser and desktop). Some adjustments like font size and filter type are made to address this issue.\r\n\r\n\r\n\r\nFigure 92: Adjustment before publishing to Tableau Public\r\n\r\n\r\n\r\n4. Observations\r\nFrom this interactive visualisation, we can observe that United Kingdom has the most positive response towards vaccination while France is leaning more towards the negative side. If we look at another question on “whether they will regret if they do not get a vaccine”, their responses are also the most negative which may suggest that majority of France respondents do not see getting vaccinated as a necessity. We can also see that Singapore is mostly neutral in this aspect.\r\n\r\n\r\n\r\nFigure 93: Which country is more positive towards vaccination?\r\n\r\n\r\n\r\nIn the previous chart, Japanese respondent is the second least positive about getting vaccinated (after France). The chart below shows that despite the Japanese respondent being the most worried about getting COVID, they are also the most concerned about the potential side effects from the vaccine. Singapore is the second country being most worried with the vaccine’s side effect.\r\n\r\n\r\n\r\nFigure 94: Which country is the most concerned about vaccine side effect?\r\n\r\n\r\n\r\nWhen we investigate the response by employment status, retired respondents are more willing to get vaccinated as compared to the rest. Interestingly, this aligns with them being the least worried about the side effect and most supportive and trusting of their government to provide effective vaccine.\r\n\r\n\r\n\r\nFigure 95: Retired respondent is more willing towards vaccination\r\n\r\n\r\n\r\nFrom the Likert scale and interactive tooltip for Singapore, the higher observation for male respondents who are willing to be vaccinated may stem from the fact that there are more female respondents who are worried about the side effects.\r\n\r\n\r\n\r\nFigure 96: Different response based on gender in Singapore\r\n\r\n\r\n\r\nComparing “strongly agree” response towards vaccination between Singapore and UK (18% vs 61%), it becomes apparent that UK has higher percentage of retired respondent (and older age group). This may suggest a possible link between a country’s demographic and country’s response towards vaccination.\r\n\r\n\r\n\r\nFigure 97: Demographic and response\r\n\r\n\r\n\r\nAny suggestion and feedback is much appreciated! Email: kevin.albindo@gmail.com\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-14-visual-makeover-2/images/vaccine.jpg",
    "last_modified": "2021-02-19T12:56:25+08:00",
    "input_file": "visual-makeover-2.utf8.md"
  },
  {
    "path": "posts/2021-01-24-visual-makeover-1/",
    "title": "Data Viz Makeover 1",
    "description": "Data visualisation critique and makeover on labour force visualisation from Singapore Ministry of Manpower 2019 annual report on \"Labour Force in Singapore\".",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": "https://www.linkedin.com/in/kgalbindo"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n\r\nContents\r\n1. Introduction\r\n2. Critique and suggestion\r\nClarity\r\nAesthetic\r\n\r\n3. Proposed visualisation\r\nSketch\r\nRationale\r\nRealising the proposed visualisation\r\nImporting data table\r\nPreparing data\r\nMain chart on distribution by age group\r\nSecond chart on distribution by aggregated age group\r\nThird chart on LFPR trend by aggregated age group\r\nPutting it all together\r\n\r\n\r\n4. Observations from visualisation\r\n5. Conclusion\r\n\r\n1. Introduction\r\nThis post is part of the submission for ISSS608 DataViz Makeover assignment 1. Data visualisation critique and makeover is done on one of the excerpt from “Labour Force in Singapore” 2019 annual report by Singapore Ministry of Manpower (link).\r\nData tables used are:\r\n- Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June) - T5\r\n- Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June) - T7\r\nBoth of them can be found here\r\nThe assessment criteria will be based on the visualisation’s clarity and aesthetic, taking reference from “Data Visualization: Clarity or Aesthetics?” by Ben Jones.\r\nHe points out that a suitable visualisation type is critical to the clarity of information that we want to convey. A good visualisation should guide the reader in arriving at the correct conclusion as intended by the author. In addition, visual aesthetic plays important role in keeping the reader engaged and giving pleasant experience when looking at the visualisation. This could be in a form of good font and layout, as well as minimising/eliminating harmful “chartjunk”.\r\nTo quantify his assessment, he mapped the clarity and aesthetics of a visualisaiton into a cartesian coordinate system with 4 quadrants.\r\n\r\n\r\n\r\nFigure 1: Clarity and aesthetics of data visualisation\r\n\r\n\r\n\r\nThe top left (Q4) refers to visualisation with low clarity but high aesthetics. This could be a visualisation with good design and layout, but the message is not clear. What we are trying to achieve is the ideal state (Q1), where the visualisation delivers clear message and aesthetically pleasant.\r\n2. Critique and suggestion\r\nThe original data visualisation that will be assessed can be found in page 5 of the report.\r\n\r\n\r\n\r\nFigure 2: Original data visualisation of labour force by age group\r\n\r\n\r\n\r\nIn the 4 quadrant system, the original visualisation can be mapped into Q4 as it has a good aesthetic view, but the reader may find it difficult to tally the visualisation with the underlying conclusion.\r\nClarity\r\nAccording to the explanation text preceding the visualisation, the author intends to compare the age distribution of labour force between 2009 and 2019 and highlight the increasing median age due to the following two observations:\r\nIncreasing share of older residents (age 55 & above) in the labour force\r\nDeclining share of younger residents (age 25-54) in the labour force\r\nWhile the median age is clearly represented by the two reference lines, the two observations above are not directly apparent. In this visualisation, the line chart provides the reader with a quick overview of the shape of distribution among different age groups. However, bar chart is a better option to compare 2009 and 2019 values. As a reference, the following rule of thumb suggest that bar chart is a suggested visualisation type to compare value among few categories, while line chart is more suitable for comparison across many periods.\r\n\r\n\r\n\r\nFigure 3: Choosing visualisation type (Lifehacker, 2012)\r\n\r\n\r\n\r\nThe current visualisation does not directly provide the percentage change between the two group of interest (25-54 and 55 & above) between 2009 and 2019. Although the value for individual age group in the table allows reader to get to the percentage change (with some mental calculation), it could be added to the visualisation to make the conclusion more visible.\r\nThe title of the visualisation does not explain the basis of the percentage used. Although the preceding paragraph alludes to the percentage being a share from total labour force in the year, the title can do more to help reader understand the visualisation. We can amend the title to emphasise the percentage is based on the yearly total labour force.\r\nAesthetic\r\nThe choice of font type and its size are good and clear, which is also consistent throughout the report itself. In addition, differentiation of 2009 and 2019 are consistently done through both colour difference and labelling of line chart, making it easy for reader to differentiate between the two periods.\r\nThe author also removes unnecessary data-ink by omitting the y-axis which directs reader straight to the shape of the distribution. However, this requires the author to provide the percentage value in tabular format for reader to make comparison. Positioning of median age at the centre draws the attention to the main conclusion. While the x-axis is of ordinal type (age group), the reference line treats the x-axis as continuous. Although this may contradict the usage of x-axis, the message on “shifting median age” is made clearer by positioning the reference line apart.\r\nThe data source and note at the bottom of the visualisation are aligned to the opposing side. Though it may be subjective, having both of them aligned to the same side will keep the layout tidier. Also, it is preferably left aligned, following reading direction from left to right.\r\n3. Proposed visualisation\r\nSketch\r\nThe following sketch shows the proposed visualisation and the rationale behind the choices made are given below.\r\n\r\n\r\n\r\nFigure 4: Sketch of proposed visualisation\r\n\r\n\r\n\r\nRationale\r\nThe comparison of two different values (2009 and 2019) is made clearer through the use of bar chart. Specifically, overlapping bar chart is chosen, as opposed to side-by-side bar chart, in order to save some space. It is also less cluttered in comparing 12 different age groups.\r\nTo connect the visualisation with the preceding text, additional bar chart is used to aggregate 12 age groups into 3 higher level groups, where 2 of them represent older and younger residents. This makes connecting the statement between the text and visualisation easier.\r\nThe author makes reference to the increasing Labour Force Participation Rate (LFPR) to support the conclusion. As this important data is unavailable in the original visualisation, the trend of LFPR is added using line chart to visualise the increasing LFPR stated in the preceding text.\r\nRealising the proposed visualisation\r\nThe proposed visualisation is made using Tableau with the 2 tables (mentioned in the first section of this post) as the data source.\r\nImporting data table\r\nBefore importing to Tableau, we first open both tables in Excel to look at the table layout.\r\n\r\n\r\n\r\nFigure 5: Raw T7 table (T5 has similar layout)\r\n\r\n\r\n\r\nThe data table is not readily usable as it includes the title text, side note, data source text, and several patches of empty cells. However, Tableau has a “Data Interpreter” function which could help with data preparation. After importing T7 excel file into Tableau, click on “Data Interpreter” and drag T7_T (referring to total) into the table area.\r\n\r\n\r\n\r\nFigure 6: Using data interpreter and import table\r\n\r\n\r\n\r\nLooking at the table view, the first column can be hidden as it does not carry any relevant data (in fact it is the side note of the raw table). Click on the small dropdown menu of the first column and select “Hide”\r\n\r\n\r\n\r\nFigure 7: Hide first column\r\n\r\n\r\n\r\nTo add the next data source (T5), click on the side of T7 data source and select New Data Source. Subsequently, select “data interpreter” option and drag T5_T into the table area. At this point, both T5 and T7 have been imported into Tableau.\r\n\r\n\r\n\r\nFigure 8: Adding T5 as a new data source\r\n\r\n\r\n\r\nPreparing data\r\nFor both T7 and T5, we will remove multiple whitespaces in the original age group text by creating a new calculated field Age group using REPLACE formula. The original age group column can then be hidden.\r\n\r\n\r\n\r\nFigure 9: Tidying up age group\r\n\r\n\r\n\r\nAt this point, the yearly labour force data in T7 is separated into different columns. This is fine as the first 2 plots will compare the value between 2009 and 2019. The null value under the Age group columnn refers to the total of the entire age group, which we are not going to use.\r\n\r\n\r\n\r\nFigure 10: T7 final appearance\r\n\r\n\r\n\r\nCurrently, the 2009-2019 LFPR data in T5 are stored separately (each year has its own individual column). For the last plot in the visualisation, we are going to visualise the trend of LFPR, which means the Year has to be one of the measure. To do so, Pivot function is used by selecting all year columns, right click and select Pivot.\r\n\r\n\r\n\r\nFigure 11: Pivoting T5 columns\r\n\r\n\r\n\r\nOnce pivoted, we can change the field name to Year and LFPR for ease of reference. The field type for Year is then changed to represent Date.\r\n\r\n\r\n\r\nFigure 12: T5 final appearance\r\n\r\n\r\n\r\nMain chart on distribution by age group\r\nThe first part of the visualisation basically transforms the original labour force distribution curve into bar charts. Open a new worksheet and select T7_T as the data source.\r\nFirst, drag the Age group from the Data pane to the Filters shelf. In the dialog box, click Exclude and select the Null value from the list. This will exclude Null row (which refer to the total value) from our plot.\r\n\r\n\r\n\r\nFigure 13: Filter to exclude Null value\r\n\r\n\r\n\r\nNext, drag 2009 and 2019 to the Columns shelf and Age group to the Rows shelf. Right click on 2019 field and select Dual Axis. In the Marks shelf, change the chart type to bar chart for both SUM(2009) and SUM(2019). Right click on the x-axis and set Synchronize Axis. Set the Worksheet View to Entire View.\r\n\r\n\r\n\r\nFigure 14: Dual axis for 2019 and 2019 value\r\n\r\n\r\n\r\nAt this point of time, the difference between 2009 and 2019 can be seen between 20-24 and 30-44 age groups. To get the percentage for each age group, right click on the SUM(2009) field, select Quick Table Calculation, and choose Percent of Total. Do the same for SUM(2019). To make the comparison clearer, some adjustments are made:\r\n- in the Columns shelf, shift SUM(2019) to the left of SUM(2009) so that it will be displayed on top\r\n- under All pane, change the type of Measure Names from color to size to differentiate bar chart size between 2009 and 2019\r\n- grey and blue color is set for SUM(2009) and SUM(2019) correspondingly\r\n- 20% opacity is set for 2009 to send a message that it is of older time period\r\nAt this stage, the chart should look like this.\r\n\r\n\r\n\r\nFigure 15: Bar chart with different size\r\n\r\n\r\n\r\nDouble click on the legend at the top right, and select Reversed so that 2019 bar chart is smaller than the 2009. Also adjust the right hand slider towards the middle so that the bar size is more comparable. Next, we can remove the top x-axis header, hide the Age group field label, adjust x-axis tick mark, and add the title of the plot.\r\n\r\n\r\n\r\nFigure 16: Further adjustment\r\n\r\n\r\n\r\nAdditional row divider is then added to clearly show the 2 main groups of interest mentioned in the text. First, we need to create an aggregated age group from Age group. To do so, right click on Age group, go to Create and select Group. In the dialog box, simply select multiple age group (e.g. 15-19 and 20-24), click on Group, and assign a new group name.\r\n\r\n\r\n\r\nFigure 17: Creating new age group\r\n\r\n\r\n\r\nA new measure Age group (group) is then created. Drag this to the Rows shelf to the left of our initial Age group. Once the row divider is seen, we can remove the header for Age group (group). The final appearance of the plot should look like this. Rename the worksheet as “Part 1” for ease of reference.\r\n\r\n\r\n\r\nFigure 18: First part of visualisation\r\n\r\n\r\n\r\nSecond chart on distribution by aggregated age group\r\nDuplicate the first worksheet and rename it to “Part 2”. Next, remove the Age group field from the Rows shelf so that the distribution is grouped into just the 3 aggregated age groups. Right click on the Age group (group) field and enable Show Header. Adjust the x-tick mark accordingly so that it shows the entire range of bar chart. The bar chart is also adjusted to be slightly thinner.\r\n\r\n\r\n\r\nFigure 19: Aggregated age group\r\n\r\n\r\n\r\nThere is enough room to show the data label in order to help reader connects the text and the visualisation. Under All pane, click on Label and select Show mark labels. Choose Min/Max and Cell for the label and scope. The minimum label is not required in this case and can be turned off from the Options menu.\r\n\r\n\r\n\r\nFigure 20: Enabling label\r\n\r\n\r\n\r\nTo differentiate the label value between 2009 and 2019 data, some adjustments are made:\r\n- font size for 2009 is made smaller (8pt) with Top-Right alignment\r\n- font size for 2019 is made bigger (10pt) with bold style\r\nThe decimal place is also removed to make it clearer. First, right click on the plot area and select Format, this will open a Format pane on the left side of the interface. Click on the Fields menu and select % of Total SUM(2009). Click on Pane, Numbers, and choose Percentage with 0 decimal place. Do the same thing for % of Total SUM(2019) field.\r\n\r\n\r\n\r\nFigure 21: Formatting label\r\n\r\n\r\n\r\nWe also activate the row divider for the aggregated age group by setting the slider for the Row Divider level accordingly.\r\n\r\n\r\n\r\nFigure 22: Second part of visualisation\r\n\r\n\r\n\r\nWe may want to look at how it pans out when the two plots are joined together. First, we create a new dashboard and drag the 2 worksheets to the dashboard side-by-side.\r\n\r\n\r\n\r\nFigure 23: Joined view of Part 1 and Part 2\r\n\r\n\r\n\r\nNow the visualisation has both the granularity of individual age group and the aggregated age group. The reader can now afford to connect the percentage in the text (67% and 25% for 2019) with the visual. However, there is a downside with this view as the row dividers are not aligned between the 2 plots as compared to the initial sketch. We will address this issue later.\r\nThird chart on LFPR trend by aggregated age group\r\nThe last part of the visualisation is to show the reader that the LFPR for the younger and older residents have increased since 2009, as what the original author has highlighted. For this, we will use the data from T5.\r\nFirst, we create new worksheet called “Part 3” and select T5_T in the data pane. Take note that T5_T contains overlapping age group, hence we should first filter out those groups and keep only the individual age groups similar to T7.\r\n\r\n\r\n\r\nFigure 24: Filter T5 age group\r\n\r\n\r\n\r\nSimilar to part 2, we then proceed to create a new aggregated age group. As there are predefined aggregated group inside T5_T, we add “group” to the group name to differentiate.\r\n\r\n\r\n\r\nFigure 25: Create aggregated age group\r\n\r\n\r\n\r\nTo plot the trend of average LFPR within each group, drag the Year to Columns shelf while Age group (group) and LFPR to the Rows shelf. Change the SUM(LFPR) to AVG(LFPR) by right clicking the field, select Measure and Average.\r\n\r\n\r\n\r\nFigure 26: Calculate average value\r\n\r\n\r\n\r\nAs each group has different initial average LFPR value, it is difficult to compare among them. Therefore, we will set the AVG(LFPR) in 2009 as the baseline and chart the difference in each year as compared to 2009. To do so, right click on the AVG(LFPR) field, select Quick Table Calculation, and choose Percent Difference. To use 2009 (first value) as the baseline, select Relative to and choose First.\r\n\r\n\r\n\r\nFigure 27: Average LFPR difference from 2009\r\n\r\n\r\n\r\nColor gradation is then added to the line chart from 2009-2019. However, we have to first change the Year measure from Discrete to Continuous type.\r\n\r\n\r\n\r\nFigure 28: Continuous Year measure\r\n\r\n\r\n\r\nHold Ctrl in the keyboard while clicking the continuous Year field, drag it from Columns shelf into the Color pane to activate coloring on the line chart.\r\n\r\n\r\n\r\nFigure 29: Line chart with color gradation\r\n\r\n\r\n\r\nAs the whole visualisation is about comparing 2009 and 2019, we can remove the x-axis title to reduce non data-ink. In addition, the color gradation helps to allude a trend towards 2019. Y-axis is also removed as the starting point for all 3 age groups is zero. Data label for 2019 is added to provide reader a comparative value between 2009 and 2019. Click Show mark labels and select Most Recent.\r\n\r\n\r\n\r\nFigure 30: Adding label to the most recent data point\r\n\r\n\r\n\r\nRight click on one of the data label and select Format. Click Fields and select % Difference in AVG(LFPR). Click Pane and change the Numbers format to Percentage with 0 decimal place.\r\n\r\n\r\n\r\nFigure 31: Label formatting\r\n\r\n\r\n\r\nThe final appearance for the third part of visualisation will look like this.\r\n\r\n\r\n\r\nFigure 32: Third part of visualisation\r\n\r\n\r\n\r\nPutting it all together\r\nIf we put all 3 parts together, we will get something like shown below. As pointed out before, the row divider among 3 parts are not the same as in the initial sketch. The label for the LFPR trend plot also now becomes illegible as it overlaps with the line plot, hence text alignment has to be adjusted. The height of the LFPR trend plot also jutted out of alignment as compared to the other 2 plots.\r\n\r\n\r\n\r\nFigure 33: Putting it all together, not quite right\r\n\r\n\r\n\r\nIn order to have the intended row divider for the last 2 plots, we have to create 3 different plots to represent each aggregated age group.\r\n\r\n\r\n\r\nFigure 34: Putting it all together, with some workaround\r\n\r\n\r\n\r\nDuplicate part 2 into 3 new worksheets where in each worksheet, we will show only 1 age group. Reactivate Show Header for Age group (group), right click the group to be hidden, and select Hide.\r\n\r\n\r\n\r\nFigure 35: Hide specific age group from view\r\n\r\n\r\n\r\nWe then hide the title and x-axis according to the order of the plots in the dashboard i.e. only the bottom plot require x-axis, only the top plot requires title.\r\n\r\n\r\n\r\nFigure 36: Putting it all together, with duplicated worksheets\r\n\r\n\r\n\r\nAdjustment to the border setting and x-axis range for each plot are done to get standardised format. Only the top and bottom plot would have horizontal border line, while the middle plot is left borderless.\r\n\r\n\r\n\r\nFigure 37: Formatting borders and lines\r\n\r\n\r\n\r\nSlight layout padding adjustment is also made in the dashboard setting to achieve better alignment between the plots. Finally, we can achieve the following appearance.\r\n\r\n\r\n\r\nFigure 38: Putting it all together, part 2 segregated and aligned\r\n\r\n\r\n\r\nRepeating the same process for LFPR trend plot, we arrive at the following appearance where all 3 plots are now aligned properly.\r\n\r\n\r\n\r\nFigure 39: Putting it all together, part 3 segregated and aligned\r\n\r\n\r\n\r\nAdding the main conclusion into the title and subtitle with some formatting done to highlight the key points:\r\n- Year 2019 uses bold style and colored blue so that reader may relate blue color with 2019\r\n- Younger and older residents are highlighted in bold style\r\n- Percentage change and LFPR are also highlighted in bold style\r\n- Shift in median age is in bold and inserted as the final statement to end the subtitle\r\nFinally, inserting data source and notes at the bottom to complete the visualisation.\r\n\r\n\r\n\r\nFigure 40: Putting it all together, final visualisation\r\n\r\n\r\n\r\nNote: The final visualisation is saved under “Desktop” dashboard. Uploading to Tableau Public makes the row divider misaligned and hence requires additional adjustment. The Tableau Public version is saved under “Public” dashboard (Tableau Public).\r\n4. Observations from visualisation\r\nThere is less younger residents aged 25-54 in the 2019 labour force. Their percentage share in the total labour force drops from 75% in 2009 to 67% in 2019. In contrast, the share of older residents aged 55 & above increases from 16% to 25%.\r\nThe distribution in 2009 has its peak percentage residing in the 35-39 age group. The peak has moved to 45-49 age group in 2019, pointing to the insufficient influx of younger age group in the labour force to balance Singapore’s aging population. This could be attributed to Singapore’s lower birth rate as pointed out by the original author.\r\nAverage participation rate of older residents (age 55 & above) into the labour force increases by 27% as compared to 2009. This is in contrast to the 5% increase in the average participation rate of younger age group. This comparison helps to explain why the share of younger resident falls despite the increasing participation rate. In addition, this observation could be useful to initiate further exploration on the retirement and re-employment policy that Singapore took towards 2019.\r\n5. Conclusion\r\nA critique and makeover on labour force distribution plot have been done by first assessing both clarity and aesthetics aspects of the original visualisation. Subsequently, a proposed new visualisation has been developed with the intention to improve the clarity of author’s intended message and visual aspects of the original visualisation. The rationale behind the choice of visualisation type and components have also been provided. Lastly, the visualisation has been realised in Tableau, with observations from the new visualisation explained.\r\nAny suggestion and feedback is much appreciated! Email: kevin.albindo@gmail.com\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-24-visual-makeover-1/images/cover.jpg",
    "last_modified": "2021-02-18T23:37:28+08:00",
    "input_file": "visual-makeover-1.utf8.md"
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Data Viz Learning",
    "description": "Welcome to my new blog Data Viz Learning!",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": {}
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\nTableau public\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-26T10:26:36+08:00",
    "input_file": {}
  }
]
