[
  {
    "path": "posts/2021-01-24-visual-makeover-1/",
    "title": "Data Viz Makeover 1",
    "description": "Data visualisation critique and makeover on labour force visualisation from Singapore Ministry of Manpower 2019 annual report on \"Labour Force in Singapore\".",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": "https://www.linkedin.com/in/kgalbindo"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n1. Introduction\r\nThis post is part of the submission for ISSS608 DataViz Makeover assignment 1. In this post, data visualisation critique and makeover is done on one of the excerpt from “Labour Force in Singapore” 2019 annual report by Singapore Ministry of Manpower (link).\r\nData tables used are:\r\n- Resident Labour Force Participation Rate by Age and Sex, 2009-2019 (June) - T5\r\n- Resident Labour Force Aged Fifteen Years and Over by Age and Sex, 2009-2019 (June) - T7\r\nBoth of them can be found here\r\nThe assessment criteria will be based on the visualisation’s clarity and aesthetic, taking reference from “Data Visualization: Clarity or Aesthetics?” by Ben Jones. In the article, he points out that a suitable visualisation type is critical to the clarity of information that we want to convey. A good visualisation should guide the reader in arriving at the correct conclusion as intended by the author. In addition, visual aesthetic plays important role in keeping the reader engaged and giving pleasant experience when looking at the visualisation. This could be in a form of good font and layout, as well as minimising harmful “chartjunk”.\r\nThe original data visualisation that will be assessed can be found in page 5 of the report.\r\n\r\n\r\n\r\nFigure 1: Original data visualisation of labour force by age group\r\n\r\n\r\n\r\n2. Critique and suggestion\r\n==== Put 4 quadrant here ====\r\nClarity\r\nAccording to the explanation text preceding the visualisation, the author intends to compare the age distribution of labour force between 2009 and 2019 and highlight the increasing median age due to the following two observations:\r\nIncreasing share of older residents (age 55 & above) in the labour force\r\nDeclining share of younger residents (age 25-54) in the labour force\r\nWhile the median age is clearly represented by the two reference lines, the two observations are not directly apparent. In this visualisation, the line chart provides the reader with a quick overview of the shape of distribution among different age groups. However, as the intention is to compare 2009 and 2019 values, bar chart is a better option according to the chart below taken from the rule of thumb in selecting visualisation type for a specific type of information.\r\n\r\n\r\n\r\nFigure 2: Choosing visualisation type (Lifehacker, 2012)\r\n\r\n\r\n\r\nThe current visualisation does not directly provide the percentage change between the two group of interest (25-54 and 55 & above) between 2009 and 2019. Although the value for individual age group allows reader to get the mentioned percentage change (with some calculation), the percentage change could be added to the visualisation to strike the conclusion clearer.\r\nThe title of the visualisation does not explain the basis of the percentage used. Although the preceding paragraph alludes to the percentage being a share from total labour force in the year, the title can do more to help reader understand the visualisation. We can amend the title to emphasise the percentage is based on the yearly total labour force.\r\nAesthetic\r\nThe choice of font type and its size are good and clear. In addition, differentiation of 2009 and 2019 are consistently done through both colour and labelling of line chart, making it easy for reader to differentiate between the two periods.\r\nThe author also removes unnecessary data-ink by omitting the y-axis which directs reader straight to the shape of the distribution. However, this require the author to provide the actual value in tabular format for reader to compare the numbers. Positioning of median age is at the centre which draws the attention to the main conclusion. However, as the x-axis is rather ordinal by age group, the reference line for median treats the x-axis as continuous. As I am unable to provide a good solution for this, I will prefer to remove the reference line and provide this median-shift conclusion in the subtitle/through annotation instead.\r\nThe data source and note at the bottom of the visualisation are aligned to the opposing side. Though it may be subjective, I would prefer to have both of them aligned to the same side, keeping it tidy. Also, preferably left aligned, following the natural reading direction from left to right.\r\n3. Proposed visualisation\r\nSketch\r\nThe following sketch shows the proposed visualisation and I will go through the rationale behind the choices made for this visualisation.\r\n\r\n\r\n\r\nFigure 3: Sketch of proposed visualisation\r\n\r\n\r\n\r\nRationale\r\nThe clarity of comparing two different values (2009 and 2019) is made clearer through the use of bar chart. Specifically, I choose overlapping bar chart as opposed to side-by-side bar chart as it allows me to save spaces and it seems to be less cluttered for comparing 12 different age groups.\r\nTo align the visualisation with the preceding text, I decided to aggregate the 12 age groups into 3 higher level groups, where 2 of them represent older and younger residents mentioned in the text.\r\nThe author makes reference to the increasing Labour Force Participation Rate (LFPR) to support the conclusion. As this important data is unavailable in the original visualisation, the trend of LFPR is added using line chart to visualise the statement on increasing LFPR made in the preceding text.\r\nRealising the proposed visualisation\r\nThe proposed visualisation is made using Tableau with the 2 tables mentioned in the first section of this post as the data source.\r\nImporting data table\r\nPreparing data in the right format\r\nCreating main chart on labour force distribution by age group\r\nCreating second chart on labour force distribution by aggregated age group\r\nCreating third chart on LFPR trend by aggregated age group\r\nPutting it all together\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-24-visual-makeover-1/images/excerpt.jpg",
    "last_modified": "2021-01-26T10:05:59+08:00",
    "input_file": "visual-makeover-1.utf8.md"
  },
  {
    "path": "posts/2021-01-04-my-first-post/",
    "title": "My first post",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": "https://www.linkedin.com/in/kgalbindo"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n1.0 Overview\r\nCorrelation coefficient is a popular statistic that use to measure the type and strength of the relationship between two variables. The values of a correlation coefficient ranges between -1.0 and 1.0. A correlation coefficient of 1 shows a perfect linear relationship between the two variables, while a -1.0 shows a perfect inverse relationship between the two variables. A correlation coeficient of 0.0 shows no linear relationship between the two variables.\r\nWhen multivariate data are used, the correlation coeficeints of the pair comparisons are displayed in a table form known as correlation matrix or scatterplot matrix.\r\nThere are three broad reasons for computing a correlation matrix.\r\nTo reveal the relationship between highdimensional variables pairwisely.\r\nTo input into other analyses. For example, people commonly use correlation matrixes as inputs for exploratory factor analysis, confirmatory factor analysis, structural equation models, and linear regression when excluding missing values pairwise.\r\nAs a diagnostic when checking other analyses. For example, with linear regression a high amount of correlations suggests that the linear regression’s estimates will be unreliable.\r\nWhen the data is large, both in terms of the number of observations and the number of variables, Corrgram tend to be used to visually explore and analyse the structure and the patterns of relations among variables. It is designed based on two main schemes:\r\nRendering the value of a correlation to depict its sign and magnitude, and\r\nReordering the variables in a correlation matrix so that “similar” variables are positioned adjacently, facilitating perception.\r\nIn this hands-on exercise, you will learn how to plot data visualisation for visualising correlation matrix with R. It consists of three main sections. First, you will learn how to create correlation matrix using pairs() of R Graphics. Next, you will learn how to plot corrgram using corrplot package of R Lastly, you will learn how to create an interactive correlation matrix using plotly R. .\r\n2.0 Installing and Launching R Packages\r\nBefore you get started, you are required:\r\nto start a new R project, and\r\nto create a new R Markdown document.\r\nNext, you will use the code chunk below to install and launch corrplot, ggpubr, plotly and tidyverse in RStudio.\r\n\r\n\r\npackages = c('ggpubr', 'tidyverse')\r\n\r\nfor(p in packages){library\r\n  if(!require(p, character.only = T)){\r\n    install.packages(p)\r\n  }\r\n  library(p, character.only = T)\r\n}\r\n\r\n\r\n\r\n3.0 Importing and Preparing The Data Set\r\nIn this hands-on exercise, the Wine Quality Data Set of UCI Machine Learning Repository will be used. The data set consists of 13 variables and 6497 observations. For the purpose of this exercise, we have combined the red wine and white wine data into one data file. It is called wine_quality and is in csv file format.\r\n3.1 Importing Data\r\nFirst, let us import the data into R by using read_csv() of readr package.\r\n\r\n\r\nwine <- read_csv(\"data/wine_quality.csv\")\r\n\r\n\r\n\r\nNotice that beside quality and type, the rest of the variables are numerical and continuous data type.\r\n4.0 Univariate EDA with Histogram\r\nIn the figure below, multiple histograms are plottted to reveal the distribution of the selected variables in the wine quality data sets.\r\n\r\n\r\n\r\nThe code chunks used to create the data visualisation consists of two main parts. First, we will create the individual histograms using the code chunk below.\r\n\r\n\r\nfa <- ggplot(data=wine, aes(x= `fixed acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nva <- ggplot(data=wine, aes(x= `volatile acidity`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nca <- ggplot(data=wine, aes(x= `citric acid`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nrs <- ggplot(data=wine, aes(x= `residual sugar`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nch <- ggplot(data=wine, aes(x= `chlorides`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nfSO2 <- ggplot(data=wine, aes(x= `free sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ntSO2 <- ggplot(data=wine, aes(x= `total sulfur dioxide`)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\ndensity <- ggplot(data=wine, aes(x= density)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\npH <- ggplot(data=wine, aes(x= pH)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nsulphates <- ggplot(data=wine, aes(x= sulphates)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\nalcohol <- ggplot(data=wine, aes(x= alcohol)) +\r\n  geom_histogram(bins=20, color=\"black\", fill=\"light blue\")\r\n\r\n\r\n\r\nNext, the ggarrange function of ggpur package is used to group these histograms together.\r\n\r\n\r\nggarrange(fa, va, ca, rs, ch, fSO2, tSO2, density, pH, sulphates, alcohol, \r\n          ncol = 4, nrow = 3)\r\n\r\n\r\n\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-04-my-first-post/my-first-post_files/figure-html5/unnamed-chunk-3-1.png",
    "last_modified": "2021-01-05T20:29:52+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Idea",
    "description": "Welcome to our new blog, Idea. We hope you enjoy \nreading what we have to say!",
    "author": [
      {
        "name": "Kevin Gunawan Albindo",
        "url": "https://www.linkedin.com/in/kgalbindo"
      }
    ],
    "date": "2021-01-04",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-04T20:59:40+08:00",
    "input_file": {}
  }
]
